oshri-almog/esp32c5-wireshark-sniffer/firmware/sdkconfig.defaults
# Target: ESP32-C5 (run `idf.py set-target esp32c5` once; this line makes it the default)
CONFIG_IDF_TARGET="esp32c5"

# The native USB port (USB-Serial-JTAG) carries ONLY the binary PCAP stream.
# Logs and panic output go to UART0 (ESP32-C5: TX=GPIO11, RX=GPIO12 / the devkit's "UART" USB port),
# because a single log line inside the stream would corrupt the capture.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y

# Start on 2.4 GHz channel 6 and stay there. The host can ask for any other channel, or a whole list of
# them, at any time, so this is only where the board begins.
# Both bands are enabled so that a 5 GHz channel asked for at run time is actually allowed.
CONFIG_SNIFFER_BAND_DUAL=y
CONFIG_SNIFFER_CHANNEL_HOPPING=n
CONFIG_SNIFFER_START_CHANNEL=6

# Capture all three 802.11 frame types: management, control and data
CONFIG_SNIFFER_CAPTURE_CTRL_FRAMES=y

# More Wi-Fi RX buffers: a sniffer receives every frame on the air, not just its own traffic
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=10

# Bluetooth LE, for the advertising sniffer. NimBLE rather than Bluedroid: it is the smaller of the
# two by a wide margin, and it still offers ble_gap_set_scan_chan(), which is what lets the host
# pick advertising channels 37, 38 and 39 the same way it picks Wi-Fi ones.
#
# Observer only. The sniffer never advertises, never connects and never pairs, so every other role
# is switched off -- it keeps the radio silent and saves the flash those roles would cost.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n


# The three stacks together do not fit the default 1 MB app partition; see partitions.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
